; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l13_p13_c13_g13)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 medicina)
	(at-box box10 deposito)
	(box-has box10 medicina)
	(at-box box11 deposito)
	(box-has box11 medicina)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-person person1 refugio2)
	(at-person person2 refugio1)
	(at-person person3 refugio12)
	(at-person person4 refugio1)
	(at-person person5 refugio12)
	(at-person person6 refugio7)
	(at-person person7 refugio6)
	(at-person person8 refugio1)
	(at-person person9 refugio12)
	(at-person person10 refugio12)
	(at-person person11 refugio11)
	(at-person person12 refugio4)
	(at-person person13 refugio7)
)

(:goal (and
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person7 comida)
	(person-has person10 comida)
	(person-has person11 medicina)
	(person-has person12 comida)
	(person-has person12 medicina)
	(person-has person13 comida)
	(person-has person13 medicina)
))
)

; plan
1. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 0 of 13
2. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 0 of 13
3. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 0 of 13
4. (move refugio1 refugio6 dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 refugio6)
   goals met: 0 of 13
5. (leave box8 refugio6 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio6) (free dron1-der) (person-has person7 comida)
   goals met: 1 of 13
6. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 1 of 13
7. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 1 of 13
8. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 1 of 13
9. (move refugio1 refugio11 dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 refugio11)
   goals met: 1 of 13
10. (leave box13 refugio11 dron1-izq dron1 person11 medicina)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 medicina)
   added: (at-box box13 refugio11) (free dron1-izq) (person-has person11 medicina)
   goals met: 2 of 13
11. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 2 of 13
12. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 2 of 13
13. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 2 of 13
14. (leave box7 refugio1 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio1) (free dron1-der) (person-has person4 comida)
   goals met: 3 of 13
15. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 3 of 13
16. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 3 of 13
17. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 3 of 13
18. (leave box12 refugio1 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 medicina)
   added: (at-box box12 refugio1) (free dron1-izq) (person-has person4 medicina)
   goals met: 4 of 13
19. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 4 of 13
20. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 4 of 13
21. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 4 of 13
22. (leave box6 refugio12 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio12) (free dron1-der) (person-has person3 comida)
   goals met: 5 of 13
23. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 5 of 13
24. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 5 of 13
25. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 5 of 13
26. (leave box5 refugio12 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio12) (free dron1-der) (person-has person5 comida)
   goals met: 6 of 13
27. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 6 of 13
28. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 6 of 13
29. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 6 of 13
30. (leave box11 refugio12 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 medicina)
   added: (at-box box11 refugio12) (free dron1-izq) (person-has person5 medicina)
   goals met: 7 of 13
31. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 7 of 13
32. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 7 of 13
33. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 7 of 13
34. (leave box4 refugio12 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio12) (free dron1-der) (person-has person10 comida)
   goals met: 8 of 13
35. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 8 of 13
36. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 8 of 13
37. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 8 of 13
38. (leave box3 refugio4 dron1-der dron1 person12 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio4) (free dron1-der) (person-has person12 comida)
   goals met: 9 of 13
39. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 9 of 13
40. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 9 of 13
41. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 9 of 13
42. (leave box10 refugio4 dron1-izq dron1 person12 medicina)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 medicina)
   added: (at-box box10 refugio4) (free dron1-izq) (person-has person12 medicina)
   goals met: 10 of 13
43. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 10 of 13
44. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 10 of 13
45. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 10 of 13
46. (leave box9 refugio7 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 medicina)
   added: (at-box box9 refugio7) (free dron1-izq) (person-has person13 medicina)
   goals met: 11 of 13
47. (leave box2 refugio7 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio7) (free dron1-der) (person-has person6 comida)
   goals met: 12 of 13
48. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 12 of 13
49. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 12 of 13
50. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 12 of 13
51. (leave box1 refugio7 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio7) (free dron1-der) (person-has person13 comida)
   goals met: 13 of 13
